var store = [{
        "title": "[next.js] x-com의 ActiveLink 만들기",
        "excerpt":"x-com의 좌측메뉴 작성 및 현재사용 중인 메뉴를 알기위해 사용하는 기능을 작성하려고 한다. ActiveLink란? 말그대로 “지금 내가 어디 페이지에 있는지 표시” 하는 기능 즉, 어느페이지에 접속해 있는지 메뉴가 볼드처리 되면서 활성화 된 기능을 뜻한다. 사용자 관점에서 본다면, 내가 어느메뉴를 사용하고 있는지 기억하고 있지는 않다. 따라서 이를 확인하려면 메뉴에 테두리가 처지던, 아니면...","categories": ["next.js"],
        "tags": [],
        "url": "/next.js/2026/02/09/next.js-session-2-20gang.html",
        "teaser": null
      },{
        "title": "[next.js] x-com의 나를 위한 트렌드 메뉴 만들기",
        "excerpt":"x-com의 좌측메뉴 작성에 이어, 이번에는 우측메뉴를 작성하려고 한다. 우측 메뉴는 이미지와 같이 “나를 위한 트렌드” 메뉴가 존재한다. 우측에 보면 Today’s News, What’s happening등 구 트위터의 “나를 위한 트렌드” 자리이다. 이 부분을 오늘 구현 해 보고자 한다. 작성방법은? 1.작성할 로그인 이후 레이아웃 파일 확인. → src/app/(afterLogin)/layout.tsx 2.파일 내부의 컴포넌트에서 작성할 영역...","categories": ["next.js"],
        "tags": [],
        "url": "/next.js/2026/02/11/next.js-session-2-21gang.html",
        "teaser": null
      },{
        "title": "[next.js] Context API - TabProvider를 활용한 홈 탭 상태관리",
        "excerpt":"x.com의 로그인 후, 메인페이지를 보게 된다면 중앙에 ‘추천/팔로우’와 ‘내용’이 등장한다. 이때 추천/팔로우를 번갈아서 클릭 했을 때, 내용이 전환 될 필요가 존재한다. 문제는 ‘추천/팔로우’와’내용’의 각 컴포넌트가 형제(병렬) 관계이기 때문에, 일반적인 props 전달로는 상태를 공유 할 수 없다는 점이다.(React는 “데이터는 위에서 아래로 흐른다.” 라는 단방향 데이터흐름 설계원칙을 가지고 있어 부모 → 자식...","categories": ["next.js"],
        "tags": [],
        "url": "/next.js/2026/02/11/next.js-session-2-22gang.html",
        "teaser": null
      },{
        "title": "[next.js] x-com의 홈 메뉴 컨텐츠 소비 기능 만들기(모달편)",
        "excerpt":"이번은 x.com의 홈 메뉴 컨텐츠 소비 기능을 만들어 보고자 한다. 많지 않은 기능처럼 보이지만, 사용자 관점에서 필요한 기능을 쪼개본다면 몇 가지 생각해야 할 부분이 많다. 첫번째, 게시글 클릭 시 모달로 상세보기 두번째, 좋아요 버튼을 누른 게시글의 버튼 색상이 달라지는 기능 세번째, 게시글 하단의 댓글/리포스트/좋아요 버튼(상호작용 인터페이스) 네번째, 새로 작성된 글을...","categories": ["next.js"],
        "tags": [],
        "url": "/next.js/2026/02/12/next.js-session-2-23gang.html",
        "teaser": null
      },{
        "title": "[고찰] 프로그래밍 학습에 왜(Why)를 묻기 시작하면서 달라진 것들",
        "excerpt":"현재, Next.js를 사용한, x.com을 작성한 시점에서 의문이 한가지 든 점이 있었다. 과연 개발공부라는 것이 다른사람이 제시한 커리큘럼대로 공부하는 것이 맞는지에 대한 의문이다. 물론 무엇이 맞고 틀리고의 문제가 아니였다. 처음 개발공부를 시작했을때는 기초적인 추상성과 그것을 구현하는 기본기에 숙달되기 위해 공부한 거였다면, 이번에 공부하는 관점은 조금 바꿀필요가 있다고 생각했다. 사실, 클론코딩을 듣고...","categories": ["고찰"],
        "tags": [],
        "url": "/%EA%B3%A0%EC%B0%B0/2026/02/19/JS-day-1.html",
        "teaser": null
      }]
